RitsuYi/STM32_Embedded_Journey/04_Projects/代码部分/Hardware/OLED.c

/***************************************************************************************
  * 鏈▼搴忕敱姹熷崗绉戞妧鍒涘缓骞跺厤璐瑰紑婧愬叡浜?
  * 浣犲彲浠ヤ换鎰忔煡鐪嬨€佷娇鐢ㄥ拰淇敼锛屽苟搴旂敤鍒拌嚜宸辩殑椤圭洰涔嬩腑
  * 绋嬪簭鐗堟潈褰掓睙鍗忕鎶€鎵€鏈夛紝浠讳綍浜烘垨缁勭粐涓嶅緱灏嗗叾鎹负宸辨湁
  * 
  * 绋嬪簭鍚嶇О锛?			0.96瀵窸LED鏄剧ず灞忛┍鍔ㄧ▼搴忥紙4閽堣剼I2C鎺ュ彛锛?
  * 绋嬪簭鍒涘缓鏃堕棿锛?		2023.10.24
  * 褰撳墠绋嬪簭鐗堟湰锛?		V2.0
  * 褰撳墠鐗堟湰鍙戝竷鏃堕棿锛?	2024.10.20
  * 
  * 姹熷崗绉戞妧瀹樻柟缃戠珯锛?	jiangxiekeji.com
  * 姹熷崗绉戞妧瀹樻柟娣樺疂搴楋細	jiangxiekeji.taobao.com
  * 绋嬪簭浠嬬粛鍙婃洿鏂板姩鎬侊細	jiangxiekeji.com/tutorial/oled.html
  * 
  * 濡傛灉浣犲彂鐜扮▼搴忎腑鐨勬紡娲炴垨鑰呯瑪璇紝鍙€氳繃閭欢鍚戞垜浠弽棣堬細feedback@jiangxiekeji.com
  * 鍙戦€侀偖浠朵箣鍓嶏紝浣犲彲浠ュ厛鍒版洿鏂板姩鎬侀〉闈㈡煡鐪嬫渶鏂扮▼搴忥紝濡傛灉姝ら棶棰樺凡缁忎慨鏀癸紝鍒欐棤闇€鍐嶅彂閭欢
  ***************************************************************************************
  */

#include "stm32f10x.h"
#include "OLED.h"
#include <string.h>
#include <math.h>
#include <stdio.h>
#include <stdarg.h>

/**
  * 鏁版嵁瀛樺偍鏍煎紡锛?
  * 绾靛悜8鐐癸紝楂樹綅鍦ㄤ笅锛屽厛浠庡乏鍒板彸锛屽啀浠庝笂鍒颁笅
  * 姣忎竴涓狟it瀵瑰簲涓€涓儚绱犵偣
  * 
  *      B0 B0                  B0 B0
  *      B1 B1                  B1 B1
  *      B2 B2                  B2 B2
  *      B3 B3  ------------->  B3 B3 --
  *      B4 B4                  B4 B4  |
  *      B5 B5                  B5 B5  |
  *      B6 B6                  B6 B6  |
  *      B7 B7                  B7 B7  |
  *                                    |
  *  -----------------------------------
  *  |   
  *  |   B0 B0                  B0 B0
  *  |   B1 B1                  B1 B1
  *  |   B2 B2                  B2 B2
  *  --> B3 B3  ------------->  B3 B3
  *      B4 B4                  B4 B4
  *      B5 B5                  B5 B5
  *      B6 B6                  B6 B6
  *      B7 B7                  B7 B7
  * 
  * 鍧愭爣杞村畾涔夛細
  * 宸︿笂瑙掍负(0, 0)鐐?
  * 妯悜鍚戝彸涓篨杞达紝鍙栧€艰寖鍥达細0~127
  * 绾靛悜鍚戜笅涓篩杞达紝鍙栧€艰寖鍥达細0~63
  * 
  *       0             X杞?          127 
  *      .------------------------------->
  *    0 |
  *      |
  *      |
  *      |
  *  Y杞?|
  *      |
  *      |
  *      |
  *   63 |
  *      v
  * 
  */


/*鍏ㄥ眬鍙橀噺*********************/

/**
  * OLED鏄惧瓨鏁扮粍
  * 鎵€鏈夌殑鏄剧ず鍑芥暟锛岄兘鍙槸瀵规鏄惧瓨鏁扮粍杩涜璇诲啓
  * 闅忓悗璋冪敤OLED_Update鍑芥暟鎴朞LED_UpdateArea鍑芥暟
  * 鎵嶄細灏嗘樉瀛樻暟缁勭殑鏁版嵁鍙戦€佸埌OLED纭欢锛岃繘琛屾樉绀?
  */
uint8_t OLED_DisplayBuf[8][128];

/*********************鍏ㄥ眬鍙橀噺*/


/*寮曡剼閰嶇疆*********************/

/**
  * 鍑?   鏁帮細OLED鍐橲CL楂樹綆鐢靛钩
  * 鍙?   鏁帮細瑕佸啓鍏CL鐨勭數骞冲€硷紝鑼冨洿锛?/1
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細褰撲笂灞傚嚱鏁伴渶瑕佸啓SCL鏃讹紝姝ゅ嚱鏁颁細琚皟鐢?
  *           鐢ㄦ埛闇€瑕佹牴鎹弬鏁颁紶鍏ョ殑鍊硷紝灏哠CL缃负楂樼數骞虫垨鑰呬綆鐢靛钩
  *           褰撳弬鏁颁紶鍏?鏃讹紝缃甋CL涓轰綆鐢靛钩锛屽綋鍙傛暟浼犲叆1鏃讹紝缃甋CL涓洪珮鐢靛钩
  */
void OLED_W_SCL(uint8_t BitValue)
{
	/*鏍规嵁BitValue鐨勫€硷紝灏哠CL缃珮鐢靛钩鎴栬€呬綆鐢靛钩*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_6, (BitAction)BitValue);
	
	/*濡傛灉鍗曠墖鏈洪€熷害杩囧揩锛屽彲鍦ㄦ娣诲姞閫傞噺寤舵椂锛屼互閬垮厤瓒呭嚭I2C閫氫俊鐨勬渶澶ч€熷害*/
	//...
}

/**
  * 鍑?   鏁帮細OLED鍐橲DA楂樹綆鐢靛钩
  * 鍙?   鏁帮細瑕佸啓鍏DA鐨勭數骞冲€硷紝鑼冨洿锛?/1
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細褰撲笂灞傚嚱鏁伴渶瑕佸啓SDA鏃讹紝姝ゅ嚱鏁颁細琚皟鐢?
  *           鐢ㄦ埛闇€瑕佹牴鎹弬鏁颁紶鍏ョ殑鍊硷紝灏哠DA缃负楂樼數骞虫垨鑰呬綆鐢靛钩
  *           褰撳弬鏁颁紶鍏?鏃讹紝缃甋DA涓轰綆鐢靛钩锛屽綋鍙傛暟浼犲叆1鏃讹紝缃甋DA涓洪珮鐢靛钩
  */
void OLED_W_SDA(uint8_t BitValue)
{
	/*鏍规嵁BitValue鐨勫€硷紝灏哠DA缃珮鐢靛钩鎴栬€呬綆鐢靛钩*/
	GPIO_WriteBit(GPIOB, GPIO_Pin_7, (BitAction)BitValue);
	
	/*濡傛灉鍗曠墖鏈洪€熷害杩囧揩锛屽彲鍦ㄦ娣诲姞閫傞噺寤舵椂锛屼互閬垮厤瓒呭嚭I2C閫氫俊鐨勬渶澶ч€熷害*/
	//...
}

/**
  * 鍑?   鏁帮細OLED寮曡剼鍒濆鍖?
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細褰撲笂灞傚嚱鏁伴渶瑕佸垵濮嬪寲鏃讹紝姝ゅ嚱鏁颁細琚皟鐢?
  *           鐢ㄦ埛闇€瑕佸皢SCL鍜孲DA寮曡剼鍒濆鍖栦负寮€婕忔ā寮忥紝骞堕噴鏀惧紩鑴?
  */
void OLED_GPIO_Init(void)
{
	uint32_t i, j;
	
	/*鍦ㄥ垵濮嬪寲鍓嶏紝鍔犲叆閫傞噺寤舵椂锛屽緟OLED渚涚數绋冲畾*/
	for (i = 0; i < 1000; i ++)
	{
		for (j = 0; j < 1000; j ++);
	}
	
	/*灏哠CL鍜孲DA寮曡剼鍒濆鍖栦负寮€婕忔ā寮?/
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
 	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_7;
 	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	/*閲婃斁SCL鍜孲DA*/
	OLED_W_SCL(1);
	OLED_W_SDA(1);
}

/*********************寮曡剼閰嶇疆*/


/*閫氫俊鍗忚*********************/

/**
  * 鍑?   鏁帮細I2C璧峰
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  */
void OLED_I2C_Start(void)
{
	OLED_W_SDA(1);		//閲婃斁SDA锛岀‘淇漇DA涓洪珮鐢靛钩
	OLED_W_SCL(1);		//閲婃斁SCL锛岀‘淇漇CL涓洪珮鐢靛钩
	OLED_W_SDA(0);		//鍦⊿CL楂樼數骞虫湡闂达紝鎷変綆SDA锛屼骇鐢熻捣濮嬩俊鍙?
	OLED_W_SCL(0);		//璧峰鍚庢妸SCL涔熸媺浣庯紝鍗充负浜嗗崰鐢ㄦ€荤嚎锛屼篃涓轰簡鏂逛究鎬荤嚎鏃跺簭鐨勬嫾鎺?
}

/**
  * 鍑?   鏁帮細I2C缁堟
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  */
void OLED_I2C_Stop(void)
{
	OLED_W_SDA(0);		//鎷変綆SDA锛岀‘淇漇DA涓轰綆鐢靛钩
	OLED_W_SCL(1);		//閲婃斁SCL锛屼娇SCL鍛堢幇楂樼數骞?
	OLED_W_SDA(1);		//鍦⊿CL楂樼數骞虫湡闂达紝閲婃斁SDA锛屼骇鐢熺粓姝俊鍙?
}

/**
  * 鍑?   鏁帮細I2C鍙戦€佷竴涓瓧鑺?
  * 鍙?   鏁帮細Byte 瑕佸彂閫佺殑涓€涓瓧鑺傛暟鎹紝鑼冨洿锛?x00~0xFF
  * 杩?鍥?鍊硷細鏃?
  */
void OLED_I2C_SendByte(uint8_t Byte)
{
	uint8_t i;
	
	/*寰幆8娆★紝涓绘満渚濇鍙戦€佹暟鎹殑姣忎竴浣?/
	for (i = 0; i < 8; i++)
	{
		/*浣跨敤鎺╃爜鐨勬柟寮忓彇鍑築yte鐨勬寚瀹氫竴浣嶆暟鎹苟鍐欏叆鍒癝DA绾?/
		/*涓や釜!鐨勪綔鐢ㄦ槸锛岃鎵€鏈夐潪闆剁殑鍊煎彉涓?*/
		OLED_W_SDA(!!(Byte & (0x80 >> i)));
		OLED_W_SCL(1);	//閲婃斁SCL锛屼粠鏈哄湪SCL楂樼數骞虫湡闂磋鍙朣DA
		OLED_W_SCL(0);	//鎷変綆SCL锛屼富鏈哄紑濮嬪彂閫佷笅涓€浣嶆暟鎹?
	}
	
	OLED_W_SCL(1);		//棰濆鐨勪竴涓椂閽燂紝涓嶅鐞嗗簲绛斾俊鍙?
	OLED_W_SCL(0);
}

/**
  * 鍑?   鏁帮細OLED鍐欏懡浠?
  * 鍙?   鏁帮細Command 瑕佸啓鍏ョ殑鍛戒护鍊硷紝鑼冨洿锛?x00~0xFF
  * 杩?鍥?鍊硷細鏃?
  */
void OLED_WriteCommand(uint8_t Command)
{
	OLED_I2C_Start();				//I2C璧峰
	OLED_I2C_SendByte(0x78);		//鍙戦€丱LED鐨処2C浠庢満鍦板潃
	OLED_I2C_SendByte(0x00);		//鎺у埗瀛楄妭锛岀粰0x00锛岃〃绀哄嵆灏嗗啓鍛戒护
	OLED_I2C_SendByte(Command);		//鍐欏叆鎸囧畾鐨勫懡浠?
	OLED_I2C_Stop();				//I2C缁堟
}

/**
  * 鍑?   鏁帮細OLED鍐欐暟鎹?
  * 鍙?   鏁帮細Data 瑕佸啓鍏ユ暟鎹殑璧峰鍦板潃
  * 鍙?   鏁帮細Count 瑕佸啓鍏ユ暟鎹殑鏁伴噺
  * 杩?鍥?鍊硷細鏃?
  */
void OLED_WriteData(uint8_t *Data, uint8_t Count)
{
	uint8_t i;
	
	OLED_I2C_Start();				//I2C璧峰
	OLED_I2C_SendByte(0x78);		//鍙戦€丱LED鐨処2C浠庢満鍦板潃
	OLED_I2C_SendByte(0x40);		//鎺у埗瀛楄妭锛岀粰0x40锛岃〃绀哄嵆灏嗗啓鏁版嵁
	/*寰幆Count娆★紝杩涜杩炵画鐨勬暟鎹啓鍏?/
	for (i = 0; i < Count; i ++)
	{
		OLED_I2C_SendByte(Data[i]);	//渚濇鍙戦€丏ata鐨勬瘡涓€涓暟鎹?
	}
	OLED_I2C_Stop();				//I2C缁堟
}

/*********************閫氫俊鍗忚*/


/*纭欢閰嶇疆*********************/

/**
  * 鍑?   鏁帮細OLED鍒濆鍖?
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細浣跨敤鍓嶏紝闇€瑕佽皟鐢ㄦ鍒濆鍖栧嚱鏁?
  */
void OLED_Init(void)
{
	OLED_GPIO_Init();			//鍏堣皟鐢ㄥ簳灞傜殑绔彛鍒濆鍖?
	
	/*鍐欏叆涓€绯诲垪鐨勫懡浠わ紝瀵筄LED杩涜鍒濆鍖栭厤缃?/
	OLED_WriteCommand(0xAE);	//璁剧疆鏄剧ず寮€鍚?鍏抽棴锛?xAE鍏抽棴锛?xAF寮€鍚?
	
	OLED_WriteCommand(0xD5);	//璁剧疆鏄剧ず鏃堕挓鍒嗛姣?鎸崱鍣ㄩ鐜?
	OLED_WriteCommand(0x80);	//0x00~0xFF
	
	OLED_WriteCommand(0xA8);	//璁剧疆澶氳矾澶嶇敤鐜?
	OLED_WriteCommand(0x3F);	//0x0E~0x3F
	
	OLED_WriteCommand(0xD3);	//璁剧疆鏄剧ず鍋忕Щ
	OLED_WriteCommand(0x00);	//0x00~0x7F
	
	OLED_WriteCommand(0x40);	//璁剧疆鏄剧ず寮€濮嬭锛?x40~0x7F
	
