RitsuYi/STM32_Embedded_Journey/04_Projects/代码部分/Hardware/OLED.c
	OLED_WriteCommand(0xA1);	//璁剧疆宸﹀彸鏂瑰悜锛?xA1姝ｅ父锛?xA0宸﹀彸鍙嶇疆
	
	OLED_WriteCommand(0xC8);	//璁剧疆涓婁笅鏂瑰悜锛?xC8姝ｅ父锛?xC0涓婁笅鍙嶇疆

	OLED_WriteCommand(0xDA);	//璁剧疆COM寮曡剼纭欢閰嶇疆
	OLED_WriteCommand(0x12);
	
	OLED_WriteCommand(0x81);	//璁剧疆瀵规瘮搴?
	OLED_WriteCommand(0xCF);	//0x00~0xFF

	OLED_WriteCommand(0xD9);	//璁剧疆棰勫厖鐢靛懆鏈?
	OLED_WriteCommand(0xF1);

	OLED_WriteCommand(0xDB);	//璁剧疆VCOMH鍙栨秷閫夋嫨绾у埆
	OLED_WriteCommand(0x30);

	OLED_WriteCommand(0xA4);	//璁剧疆鏁翠釜鏄剧ず鎵撳紑/鍏抽棴

	OLED_WriteCommand(0xA6);	//璁剧疆姝ｅ父/鍙嶈壊鏄剧ず锛?xA6姝ｅ父锛?xA7鍙嶈壊

	OLED_WriteCommand(0x8D);	//璁剧疆鍏呯數娉?
	OLED_WriteCommand(0x14);

	OLED_WriteCommand(0xAF);	//寮€鍚樉绀?
	
	OLED_Clear();				//娓呯┖鏄惧瓨鏁扮粍
	OLED_Update();				//鏇存柊鏄剧ず锛屾竻灞忥紝闃叉鍒濆鍖栧悗鏈樉绀哄唴瀹规椂鑺卞睆
}

/**
  * 鍑?   鏁帮細OLED璁剧疆鏄剧ず鍏夋爣浣嶇疆
  * 鍙?   鏁帮細Page 鎸囧畾鍏夋爣鎵€鍦ㄧ殑椤碉紝鑼冨洿锛?~7
  * 鍙?   鏁帮細X 鎸囧畾鍏夋爣鎵€鍦ㄧ殑X杞村潗鏍囷紝鑼冨洿锛?~127
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細OLED榛樿鐨刌杞达紝鍙兘8涓狟it涓轰竴缁勫啓鍏ワ紝鍗?椤电瓑浜?涓猋杞村潗鏍?
  */
void OLED_SetCursor(uint8_t Page, uint8_t X)
{
	/*濡傛灉浣跨敤姝ょ▼搴忛┍鍔?.3瀵哥殑OLED鏄剧ず灞忥紝鍒欓渶瑕佽В闄ゆ娉ㄩ噴*/
	/*鍥犱负1.3瀵哥殑OLED椹卞姩鑺墖锛圫H1106锛夋湁132鍒?/
	/*灞忓箷鐨勮捣濮嬪垪鎺ュ湪浜嗙2鍒楋紝鑰屼笉鏄0鍒?/
	/*鎵€浠ラ渶瑕佸皢X鍔?锛屾墠鑳芥甯告樉绀?/
//	X += 2;
	
	/*閫氳繃鎸囦护璁剧疆椤靛湴鍧€鍜屽垪鍦板潃*/
	OLED_WriteCommand(0xB0 | Page);					//璁剧疆椤典綅缃?
	OLED_WriteCommand(0x10 | ((X & 0xF0) >> 4));	//璁剧疆X浣嶇疆楂?浣?
	OLED_WriteCommand(0x00 | (X & 0x0F));			//璁剧疆X浣嶇疆浣?浣?
}

/*********************纭欢閰嶇疆*/


/*宸ュ叿鍑芥暟*********************/

/*宸ュ叿鍑芥暟浠呬緵鍐呴儴閮ㄥ垎鍑芥暟浣跨敤*/

/**
  * 鍑?   鏁帮細娆℃柟鍑芥暟
  * 鍙?   鏁帮細X 搴曟暟
  * 鍙?   鏁帮細Y 鎸囨暟
  * 杩?鍥?鍊硷細绛変簬X鐨刌娆℃柟
  */
uint32_t OLED_Pow(uint32_t X, uint32_t Y)
{
	uint32_t Result = 1;	//缁撴灉榛樿涓?
	while (Y --)			//绱箻Y娆?
	{
		Result *= X;		//姣忔鎶奨绱箻鍒扮粨鏋滀笂
	}
	return Result;
}

/**
  * 鍑?   鏁帮細鍒ゆ柇鎸囧畾鐐规槸鍚﹀湪鎸囧畾澶氳竟褰㈠唴閮?
  * 鍙?   鏁帮細nvert 澶氳竟褰㈢殑椤剁偣鏁?
  * 鍙?   鏁帮細vertx verty 鍖呭惈澶氳竟褰㈤《鐐圭殑x鍜寉鍧愭爣鐨勬暟缁?
  * 鍙?   鏁帮細testx testy 娴嬭瘯鐐圭殑X鍜寉鍧愭爣
  * 杩?鍥?鍊硷細鎸囧畾鐐规槸鍚﹀湪鎸囧畾澶氳竟褰㈠唴閮紝1锛氬湪鍐呴儴锛?锛氫笉鍦ㄥ唴閮?
  */
uint8_t OLED_pnpoly(uint8_t nvert, int16_t *vertx, int16_t *verty, int16_t testx, int16_t testy)
{
	int16_t i, j, c = 0;
	
	/*姝ょ畻娉曠敱W. Randolph Franklin鎻愬嚭*/
	/*鍙傝€冮摼鎺ワ細https://wrfranklin.org/Research/Short_Notes/pnpoly.html*/
	for (i = 0, j = nvert - 1; i < nvert; j = i++)
	{
		if (((verty[i] > testy) != (verty[j] > testy)) &&
			(testx < (vertx[j] - vertx[i]) * (testy - verty[i]) / (verty[j] - verty[i]) + vertx[i]))
		{
			c = !c;
		}
	}
	return c;
}

/**
  * 鍑?   鏁帮細鍒ゆ柇鎸囧畾鐐规槸鍚﹀湪鎸囧畾瑙掑害鍐呴儴
  * 鍙?   鏁帮細X Y 鎸囧畾鐐圭殑鍧愭爣
  * 鍙?   鏁帮細StartAngle EndAngle 璧峰瑙掑害鍜岀粓姝㈣搴︼紝鑼冨洿锛?180~180
  *           姘村钩鍚戝彸涓?搴︼紝姘村钩鍚戝乏涓?80搴︽垨-180搴︼紝涓嬫柟涓烘鏁帮紝涓婃柟涓鸿礋鏁帮紝椤烘椂閽堟棆杞?
  * 杩?鍥?鍊硷細鎸囧畾鐐规槸鍚﹀湪鎸囧畾瑙掑害鍐呴儴锛?锛氬湪鍐呴儴锛?锛氫笉鍦ㄥ唴閮?
  */
uint8_t OLED_IsInAngle(int16_t X, int16_t Y, int16_t StartAngle, int16_t EndAngle)
{
	int16_t PointAngle;
	PointAngle = atan2(Y, X) / 3.14 * 180;	//璁＄畻鎸囧畾鐐圭殑寮у害锛屽苟杞崲涓鸿搴﹁〃绀?
	if (StartAngle < EndAngle)	//璧峰瑙掑害灏忎簬缁堟瑙掑害鐨勬儏鍐?
	{
		/*濡傛灉鎸囧畾瑙掑害鍦ㄨ捣濮嬬粓姝㈣搴︿箣闂达紝鍒欏垽瀹氭寚瀹氱偣鍦ㄦ寚瀹氳搴?/
		if (PointAngle >= StartAngle && PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	else			//璧峰瑙掑害澶т簬浜庣粓姝㈣搴︾殑鎯呭喌
	{
		/*濡傛灉鎸囧畾瑙掑害澶т簬璧峰瑙掑害鎴栬€呭皬浜庣粓姝㈣搴︼紝鍒欏垽瀹氭寚瀹氱偣鍦ㄦ寚瀹氳搴?/
		if (PointAngle >= StartAngle || PointAngle <= EndAngle)
		{
			return 1;
		}
	}
	return 0;		//涓嶆弧瓒充互涓婃潯浠讹紝鍒欏垽鏂垽瀹氭寚瀹氱偣涓嶅湪鎸囧畾瑙掑害
}

/*********************宸ュ叿鍑芥暟*/


/*鍔熻兘鍑芥暟*********************/

/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍鏇存柊鍒癘LED灞忓箷
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細鎵€鏈夌殑鏄剧ず鍑芥暟锛岄兘鍙槸瀵筄LED鏄惧瓨鏁扮粍杩涜璇诲啓
  *           闅忓悗璋冪敤OLED_Update鍑芥暟鎴朞LED_UpdateArea鍑芥暟
  *           鎵嶄細灏嗘樉瀛樻暟缁勭殑鏁版嵁鍙戦€佸埌OLED纭欢锛岃繘琛屾樉绀?
  *           鏁呰皟鐢ㄦ樉绀哄嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_Update(void)
{
	uint8_t j;
	/*閬嶅巻姣忎竴椤?/
	for (j = 0; j < 8; j ++)
	{
		/*璁剧疆鍏夋爣浣嶇疆涓烘瘡涓€椤电殑绗竴鍒?/
		OLED_SetCursor(j, 0);
		/*杩炵画鍐欏叆128涓暟鎹紝灏嗘樉瀛樻暟缁勭殑鏁版嵁鍐欏叆鍒癘LED纭欢*/
		OLED_WriteData(OLED_DisplayBuf[j], 128);
	}
}

/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍閮ㄥ垎鏇存柊鍒癘LED灞忓箷
  * 鍙?   鏁帮細X 鎸囧畾鍖哄煙宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍖哄煙宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Width 鎸囧畾鍖哄煙鐨勫搴︼紝鑼冨洿锛?~128
  * 鍙?   鏁帮細Height 鎸囧畾鍖哄煙鐨勯珮搴︼紝鑼冨洿锛?~64
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細姝ゅ嚱鏁颁細鑷冲皯鏇存柊鍙傛暟鎸囧畾鐨勫尯鍩?
  *           濡傛灉鏇存柊鍖哄煙Y杞村彧鍖呭惈閮ㄥ垎椤碉紝鍒欏悓涓€椤电殑鍓╀綑閮ㄥ垎浼氳窡闅忎竴璧锋洿鏂?
  * 璇?   鏄庯細鎵€鏈夌殑鏄剧ず鍑芥暟锛岄兘鍙槸瀵筄LED鏄惧瓨鏁扮粍杩涜璇诲啓
  *           闅忓悗璋冪敤OLED_Update鍑芥暟鎴朞LED_UpdateArea鍑芥暟
  *           鎵嶄細灏嗘樉瀛樻暟缁勭殑鏁版嵁鍙戦€佸埌OLED纭欢锛岃繘琛屾樉绀?
  *           鏁呰皟鐢ㄦ樉绀哄嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_UpdateArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t j;
	int16_t Page, Page1;
	
	/*璐熸暟鍧愭爣鍦ㄨ绠楅〉鍦板潃鏃堕渶瑕佸姞涓€涓亸绉?/
	/*(Y + Height - 1) / 8 + 1鐨勭洰鐨勬槸(Y + Height) / 8骞跺悜涓婂彇鏁?/
	Page = Y / 8;
	Page1 = (Y + Height - 1) / 8 + 1;
	if (Y < 0)
	{
		Page -= 1;
		Page1 -= 1;
	}
	
	/*閬嶅巻鎸囧畾鍖哄煙娑夊強鐨勭浉鍏抽〉*/
	for (j = Page; j < Page1; j ++)
	{
		if (X >= 0 && X <= 127 && j >= 0 && j <= 7)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
		{
			/*璁剧疆鍏夋爣浣嶇疆涓虹浉鍏抽〉鐨勬寚瀹氬垪*/
			OLED_SetCursor(j, X);
			/*杩炵画鍐欏叆Width涓暟鎹紝灏嗘樉瀛樻暟缁勭殑鏁版嵁鍐欏叆鍒癘LED纭欢*/
			OLED_WriteData(&OLED_DisplayBuf[j][X], Width);
		}
	}
}

/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍鍏ㄩ儴娓呴浂
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_Clear(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//閬嶅巻8椤?
	{
		for (i = 0; i < 128; i ++)			//閬嶅巻128鍒?
		{
			OLED_DisplayBuf[j][i] = 0x00;	//灏嗘樉瀛樻暟缁勬暟鎹叏閮ㄦ竻闆?
		}
	}
}

/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍閮ㄥ垎娓呴浂
  * 鍙?   鏁帮細X 鎸囧畾鍖哄煙宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍖哄煙宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Width 鎸囧畾鍖哄煙鐨勫搴︼紝鑼冨洿锛?~128
  * 鍙?   鏁帮細Height 鎸囧畾鍖哄煙鐨勯珮搴︼紝鑼冨洿锛?~64
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ClearArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//閬嶅巻鎸囧畾椤?
	{
		for (i = X; i < X + Width; i ++)	//閬嶅巻鎸囧畾鍒?
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)				//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
			{
				OLED_DisplayBuf[j / 8][i] &= ~(0x01 << (j % 8));	//灏嗘樉瀛樻暟缁勬寚瀹氭暟鎹竻闆?
			}
		}
	}
}

/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍鍏ㄩ儴鍙栧弽
  * 鍙?   鏁帮細鏃?
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_Reverse(void)
{
	uint8_t i, j;
	for (j = 0; j < 8; j ++)				//閬嶅巻8椤?
	{
		for (i = 0; i < 128; i ++)			//閬嶅巻128鍒?
		{
			OLED_DisplayBuf[j][i] ^= 0xFF;	//灏嗘樉瀛樻暟缁勬暟鎹叏閮ㄥ彇鍙?
		}
	}
}
	
/**
  * 鍑?   鏁帮細灏哋LED鏄惧瓨鏁扮粍閮ㄥ垎鍙栧弽
  * 鍙?   鏁帮細X 鎸囧畾鍖哄煙宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍖哄煙宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Width 鎸囧畾鍖哄煙鐨勫搴︼紝鑼冨洿锛?~128
  * 鍙?   鏁帮細Height 鎸囧畾鍖哄煙鐨勯珮搴︼紝鑼冨洿锛?~64
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ReverseArea(int16_t X, int16_t Y, uint8_t Width, uint8_t Height)
{
	int16_t i, j;
	
	for (j = Y; j < Y + Height; j ++)		//閬嶅巻鎸囧畾椤?
	{
		for (i = X; i < X + Width; i ++)	//閬嶅巻鎸囧畾鍒?
		{
			if (i >= 0 && i <= 127 && j >=0 && j <= 63)			//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
			{
				OLED_DisplayBuf[j / 8][i] ^= 0x01 << (j % 8);	//灏嗘樉瀛樻暟缁勬寚瀹氭暟鎹彇鍙?
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず涓€涓瓧绗?
  * 鍙?   鏁帮細X 鎸囧畾瀛楃宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾瀛楃宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Char 鎸囧畾瑕佹樉绀虹殑瀛楃锛岃寖鍥达細ASCII鐮佸彲瑙佸瓧绗?
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowChar(int16_t X, int16_t Y, char Char, uint8_t FontSize)
{
	if (FontSize == OLED_8X16)		//瀛椾綋涓哄8鍍忕礌锛岄珮16鍍忕礌
	{
		/*灏咥SCII瀛楁ā搴揙LED_F8x16鐨勬寚瀹氭暟鎹互8*16鐨勫浘鍍忔牸寮忔樉绀?/
		OLED_ShowImage(X, Y, 8, 16, OLED_F8x16[Char - ' ']);
	}
	else if(FontSize == OLED_6X8)	//瀛椾綋涓哄6鍍忕礌锛岄珮8鍍忕礌
	{
		/*灏咥SCII瀛楁ā搴揙LED_F6x8鐨勬寚瀹氭暟鎹互6*8鐨勫浘鍍忔牸寮忔樉绀?/
		OLED_ShowImage(X, Y, 6, 8, OLED_F6x8[Char - ' ']);
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず瀛楃涓诧紙鏀寔ASCII鐮佸拰涓枃娣峰悎鍐欏叆锛?
  * 鍙?   鏁帮細X 鎸囧畾瀛楃涓插乏涓婅鐨勬í鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾瀛楃涓插乏涓婅鐨勭旱鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細String 鎸囧畾瑕佹樉绀虹殑瀛楃涓诧紝鑼冨洿锛欰SCII鐮佸彲瑙佸瓧绗︽垨涓枃瀛楃缁勬垚鐨勫瓧绗︿覆
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細鏄剧ず鐨勪腑鏂囧瓧绗﹂渶瑕佸湪OLED_Data.c閲岀殑OLED_CF16x16鏁扮粍瀹氫箟
  *           鏈壘鍒版寚瀹氫腑鏂囧瓧绗︽椂锛屼細鏄剧ず榛樿鍥惧舰锛堜竴涓柟妗嗭紝鍐呴儴涓€涓棶鍙凤級
  *           褰撳瓧浣撳ぇ灏忎负OLED_8X16鏃讹紝涓枃瀛楃浠?6*16鐐归樀姝ｅ父鏄剧ず
  *           褰撳瓧浣撳ぇ灏忎负OLED_6X8鏃讹紝涓枃瀛楃浠?*8鐐归樀鏄剧ず'?'
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowString(int16_t X, int16_t Y, char *String, uint8_t FontSize)
{
	uint16_t i = 0;
	char SingleChar[5];
	uint8_t CharLength = 0;
	uint16_t XOffset = 0;
	uint16_t pIndex;
	
	while (String[i] != '\0')	//閬嶅巻瀛楃涓?
	{
		
#ifdef OLED_CHARSET_UTF8						//瀹氫箟瀛楃闆嗕负UTF8
		/*姝ゆ浠ｇ爜鐨勭洰鐨勬槸锛屾彁鍙朥TF8瀛楃涓蹭腑鐨勪竴涓瓧绗︼紝杞瓨鍒癝ingleChar瀛愬瓧绗︿覆涓?/
		/*鍒ゆ柇UTF8缂栫爜绗竴涓瓧鑺傜殑鏍囧織浣?/
		if ((String[i] & 0x80) == 0x00)			//绗竴涓瓧鑺備负0xxxxxxx
		{
			CharLength = 1;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];		//灏嗙涓€涓瓧鑺傚啓鍏ingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			SingleChar[1] = '\0';				//涓篠ingleChar娣诲姞瀛楃涓茬粨鏉熸爣蹇椾綅
		}
		else if ((String[i] & 0xE0) == 0xC0)	//绗竴涓瓧鑺備负110xxxxx
		{
			CharLength = 2;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];		//灏嗙涓€涓瓧鑺傚啓鍏ingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			if (String[i] == '\0') {break;}		//鎰忓鎯呭喌锛岃烦鍑哄惊鐜紝缁撴潫鏄剧ず
			SingleChar[1] = String[i ++];		//灏嗙浜屼釜瀛楄妭鍐欏叆SingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			SingleChar[2] = '\0';				//涓篠ingleChar娣诲姞瀛楃涓茬粨鏉熸爣蹇椾綅
		}
		else if ((String[i] & 0xF0) == 0xE0)	//绗竴涓瓧鑺備负1110xxxx
		{
			CharLength = 3;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[1] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[2] = String[i ++];
			SingleChar[3] = '\0';
		}
		else if ((String[i] & 0xF8) == 0xF0)	//绗竴涓瓧鑺備负11110xxx
		{
			CharLength = 4;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[1] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[2] = String[i ++];
			if (String[i] == '\0') {break;}
			SingleChar[3] = String[i ++];
			SingleChar[4] = '\0';
		}
		else
		{
			i ++;			//鎰忓鎯呭喌锛宨鎸囧悜涓嬩竴涓瓧鑺傦紝蹇界暐姝ゅ瓧鑺傦紝缁х画鍒ゆ柇涓嬩竴涓瓧鑺?
			continue;
		}
#endif
		
#ifdef OLED_CHARSET_GB2312						//瀹氫箟瀛楃闆嗕负GB2312
		/*姝ゆ浠ｇ爜鐨勭洰鐨勬槸锛屾彁鍙朑B2312瀛楃涓蹭腑鐨勪竴涓瓧绗︼紝杞瓨鍒癝ingleChar瀛愬瓧绗︿覆涓?/
		/*鍒ゆ柇GB2312瀛楄妭鐨勬渶楂樹綅鏍囧織浣?/
		if ((String[i] & 0x80) == 0x00)			//鏈€楂樹綅涓?
		{
			CharLength = 1;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];		//灏嗙涓€涓瓧鑺傚啓鍏ingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			SingleChar[1] = '\0';				//涓篠ingleChar娣诲姞瀛楃涓茬粨鏉熸爣蹇椾綅
		}
		else									//鏈€楂樹綅涓?
		{
			CharLength = 2;						//瀛楃涓?瀛楄妭
			SingleChar[0] = String[i ++];		//灏嗙涓€涓瓧鑺傚啓鍏ingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			if (String[i] == '\0') {break;}		//鎰忓鎯呭喌锛岃烦鍑哄惊鐜紝缁撴潫鏄剧ず
			SingleChar[1] = String[i ++];		//灏嗙浜屼釜瀛楄妭鍐欏叆SingleChar绗?涓綅缃紝闅忓悗i鎸囧悜涓嬩竴涓瓧鑺?
			SingleChar[2] = '\0';				//涓篠ingleChar娣诲姞瀛楃涓茬粨鏉熸爣蹇椾綅
		}
#endif
		
		/*鏄剧ず涓婅堪浠ｇ爜鎻愬彇鍒扮殑SingleChar*/
		if (CharLength == 1)	//濡傛灉鏄崟瀛楄妭瀛楃
		{
			/*浣跨敤OLED_ShowChar鏄剧ず姝ゅ瓧绗?/
			OLED_ShowChar(X + XOffset, Y, SingleChar[0], FontSize);
			XOffset += FontSize;
		}
		else					//鍚﹀垯锛屽嵆澶氬瓧鑺傚瓧绗?
		{
			/*閬嶅巻鏁翠釜瀛楁ā搴擄紝浠庡瓧妯″簱涓鎵炬瀛楃鐨勬暟鎹?/
			/*濡傛灉鎵惧埌鏈€鍚庝竴涓瓧绗︼紙瀹氫箟涓虹┖瀛楃涓诧級锛屽垯琛ㄧず瀛楃鏈湪瀛楁ā搴撳畾涔夛紝鍋滄瀵绘壘*/
			for (pIndex = 0; strcmp(OLED_CF16x16[pIndex].Index, "") != 0; pIndex ++)
			{
				/*鎵惧埌鍖归厤鐨勫瓧绗?/
				if (strcmp(OLED_CF16x16[pIndex].Index, SingleChar) == 0)
				{
					break;		//璺冲嚭寰幆锛屾鏃秔Index鐨勫€间负鎸囧畾瀛楃鐨勭储寮?
				}
			}
			if (FontSize == OLED_8X16)		//缁欏畾瀛椾綋涓?*16鐐归樀
			{
				/*灏嗗瓧妯″簱OLED_CF16x16鐨勬寚瀹氭暟鎹互16*16鐨勫浘鍍忔牸寮忔樉绀?/
				OLED_ShowImage(X + XOffset, Y, 16, 16, OLED_CF16x16[pIndex].Data);
				XOffset += 16;
			}
			else if (FontSize == OLED_6X8)	//缁欏畾瀛椾綋涓?*8鐐归樀
			{
				/*绌洪棿涓嶈冻锛屾浣嶇疆鏄剧ず'?'*/
				OLED_ShowChar(X + XOffset, Y, '?', OLED_6X8);
				XOffset += OLED_6X8;
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず鏁板瓧锛堝崄杩涘埗锛屾鏁存暟锛?
  * 鍙?   鏁帮細X 鎸囧畾鏁板瓧宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏁板瓧宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Number 鎸囧畾瑕佹樉绀虹殑鏁板瓧锛岃寖鍥达細0~4294967295
  * 鍙?   鏁帮細Length 鎸囧畾鏁板瓧鐨勯暱搴︼紝鑼冨洿锛?~10
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//閬嶅巻鏁板瓧鐨勬瘡涓€浣?						
	{
		/*璋冪敤OLED_ShowChar鍑芥暟锛屼緷娆℃樉绀烘瘡涓暟瀛?/
		/*Number / OLED_Pow(10, Length - i - 1) % 10 鍙互鍗佽繘鍒舵彁鍙栨暟瀛楃殑姣忎竴浣?/
		/*+ '0' 鍙皢鏁板瓧杞崲涓哄瓧绗︽牸寮?/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず鏈夌鍙锋暟瀛楋紙鍗佽繘鍒讹紝鏁存暟锛?
  * 鍙?   鏁帮細X 鎸囧畾鏁板瓧宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏁板瓧宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Number 鎸囧畾瑕佹樉绀虹殑鏁板瓧锛岃寖鍥达細-2147483648~2147483647
  * 鍙?   鏁帮細Length 鎸囧畾鏁板瓧鐨勯暱搴︼紝鑼冨洿锛?~10
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowSignedNum(int16_t X, int16_t Y, int32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	uint32_t Number1;
	
	if (Number >= 0)						//鏁板瓧澶т簬绛変簬0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//鏄剧ず+鍙?
		Number1 = Number;					//Number1鐩存帴绛変簬Number
	}
	else									//鏁板瓧灏忎簬0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//鏄剧ず-鍙?
		Number1 = -Number;					//Number1绛変簬Number鍙栬礋
	}
	
	for (i = 0; i < Length; i++)			//閬嶅巻鏁板瓧鐨勬瘡涓€浣?							
	{
		/*璋冪敤OLED_ShowChar鍑芥暟锛屼緷娆℃樉绀烘瘡涓暟瀛?/
		/*Number1 / OLED_Pow(10, Length - i - 1) % 10 鍙互鍗佽繘鍒舵彁鍙栨暟瀛楃殑姣忎竴浣?/
		/*+ '0' 鍙皢鏁板瓧杞崲涓哄瓧绗︽牸寮?/
		OLED_ShowChar(X + (i + 1) * FontSize, Y, Number1 / OLED_Pow(10, Length - i - 1) % 10 + '0', FontSize);
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず鍗佸叚杩涘埗鏁板瓧锛堝崄鍏繘鍒讹紝姝ｆ暣鏁帮級
  * 鍙?   鏁帮細X 鎸囧畾鏁板瓧宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏁板瓧宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Number 鎸囧畾瑕佹樉绀虹殑鏁板瓧锛岃寖鍥达細0x00000000~0xFFFFFFFF
  * 鍙?   鏁帮細Length 鎸囧畾鏁板瓧鐨勯暱搴︼紝鑼冨洿锛?~8
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowHexNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i, SingleNumber;
	for (i = 0; i < Length; i++)		//閬嶅巻鏁板瓧鐨勬瘡涓€浣?
	{
		/*浠ュ崄鍏繘鍒舵彁鍙栨暟瀛楃殑姣忎竴浣?/
		SingleNumber = Number / OLED_Pow(16, Length - i - 1) % 16;
		
