RitsuYi/STM32_Embedded_Journey/04_Projects/代码部分/Hardware/OLED.c
		if (SingleNumber < 10)			//鍗曚釜鏁板瓧灏忎簬10
		{
			/*璋冪敤OLED_ShowChar鍑芥暟锛屾樉绀烘鏁板瓧*/
			/*+ '0' 鍙皢鏁板瓧杞崲涓哄瓧绗︽牸寮?/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber + '0', FontSize);
		}
		else							//鍗曚釜鏁板瓧澶т簬10
		{
			/*璋冪敤OLED_ShowChar鍑芥暟锛屾樉绀烘鏁板瓧*/
			/*+ 'A' 鍙皢鏁板瓧杞崲涓轰粠A寮€濮嬬殑鍗佸叚杩涘埗瀛楃*/
			OLED_ShowChar(X + i * FontSize, Y, SingleNumber - 10 + 'A', FontSize);
		}
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず浜岃繘鍒舵暟瀛楋紙浜岃繘鍒讹紝姝ｆ暣鏁帮級
  * 鍙?   鏁帮細X 鎸囧畾鏁板瓧宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏁板瓧宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Number 鎸囧畾瑕佹樉绀虹殑鏁板瓧锛岃寖鍥达細0x00000000~0xFFFFFFFF
  * 鍙?   鏁帮細Length 鎸囧畾鏁板瓧鐨勯暱搴︼紝鑼冨洿锛?~16
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowBinNum(int16_t X, int16_t Y, uint32_t Number, uint8_t Length, uint8_t FontSize)
{
	uint8_t i;
	for (i = 0; i < Length; i++)		//閬嶅巻鏁板瓧鐨勬瘡涓€浣?
	{
		/*璋冪敤OLED_ShowChar鍑芥暟锛屼緷娆℃樉绀烘瘡涓暟瀛?/
		/*Number / OLED_Pow(2, Length - i - 1) % 2 鍙互浜岃繘鍒舵彁鍙栨暟瀛楃殑姣忎竴浣?/
		/*+ '0' 鍙皢鏁板瓧杞崲涓哄瓧绗︽牸寮?/
		OLED_ShowChar(X + i * FontSize, Y, Number / OLED_Pow(2, Length - i - 1) % 2 + '0', FontSize);
	}
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず娴偣鏁板瓧锛堝崄杩涘埗锛屽皬鏁帮級
  * 鍙?   鏁帮細X 鎸囧畾鏁板瓧宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏁板瓧宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Number 鎸囧畾瑕佹樉绀虹殑鏁板瓧锛岃寖鍥达細-4294967295.0~4294967295.0
  * 鍙?   鏁帮細IntLength 鎸囧畾鏁板瓧鐨勬暣鏁颁綅闀垮害锛岃寖鍥达細0~10
  * 鍙?   鏁帮細FraLength 鎸囧畾鏁板瓧鐨勫皬鏁颁綅闀垮害锛岃寖鍥达細0~9锛屽皬鏁拌繘琛屽洓鑸嶄簲鍏ユ樉绀?
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowFloatNum(int16_t X, int16_t Y, double Number, uint8_t IntLength, uint8_t FraLength, uint8_t FontSize)
{
	uint32_t PowNum, IntNum, FraNum;
	
	if (Number >= 0)						//鏁板瓧澶т簬绛変簬0
	{
		OLED_ShowChar(X, Y, '+', FontSize);	//鏄剧ず+鍙?
	}
	else									//鏁板瓧灏忎簬0
	{
		OLED_ShowChar(X, Y, '-', FontSize);	//鏄剧ず-鍙?
		Number = -Number;					//Number鍙栬礋
	}
	
	/*鎻愬彇鏁存暟閮ㄥ垎鍜屽皬鏁伴儴鍒?/
	IntNum = Number;						//鐩存帴璧嬪€肩粰鏁村瀷鍙橀噺锛屾彁鍙栨暣鏁?
	Number -= IntNum;						//灏哊umber鐨勬暣鏁板噺鎺夛紝闃叉涔嬪悗灏嗗皬鏁颁箻鍒版暣鏁版椂鍥犳暟杩囧ぇ閫犳垚閿欒
	PowNum = OLED_Pow(10, FraLength);		//鏍规嵁鎸囧畾灏忔暟鐨勪綅鏁帮紝纭畾涔樻暟
	FraNum = round(Number * PowNum);		//灏嗗皬鏁颁箻鍒版暣鏁帮紝鍚屾椂鍥涜垗浜斿叆锛岄伩鍏嶆樉绀鸿宸?
	IntNum += FraNum / PowNum;				//鑻ュ洓鑸嶄簲鍏ラ€犳垚浜嗚繘浣嶏紝鍒欓渶瑕佸啀鍔犵粰鏁存暟
	
	/*鏄剧ず鏁存暟閮ㄥ垎*/
	OLED_ShowNum(X + FontSize, Y, IntNum, IntLength, FontSize);
	
	/*鏄剧ず灏忔暟鐐?/
	OLED_ShowChar(X + (IntLength + 1) * FontSize, Y, '.', FontSize);
	
	/*鏄剧ず灏忔暟閮ㄥ垎*/
	OLED_ShowNum(X + (IntLength + 2) * FontSize, Y, FraNum, FraLength, FontSize);
}

/**
  * 鍑?   鏁帮細OLED鏄剧ず鍥惧儚
  * 鍙?   鏁帮細X 鎸囧畾鍥惧儚宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍥惧儚宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Width 鎸囧畾鍥惧儚鐨勫搴︼紝鑼冨洿锛?~128
  * 鍙?   鏁帮細Height 鎸囧畾鍥惧儚鐨勯珮搴︼紝鑼冨洿锛?~64
  * 鍙?   鏁帮細Image 鎸囧畾瑕佹樉绀虹殑鍥惧儚
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_ShowImage(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, const uint8_t *Image)
{
	uint8_t i = 0, j = 0;
	int16_t Page, Shift;
	
	/*灏嗗浘鍍忔墍鍦ㄥ尯鍩熸竻绌?/
	OLED_ClearArea(X, Y, Width, Height);
	
	/*閬嶅巻鎸囧畾鍥惧儚娑夊強鐨勭浉鍏抽〉*/
	/*(Height - 1) / 8 + 1鐨勭洰鐨勬槸Height / 8骞跺悜涓婂彇鏁?/
	for (j = 0; j < (Height - 1) / 8 + 1; j ++)
	{
		/*閬嶅巻鎸囧畾鍥惧儚娑夊強鐨勭浉鍏冲垪*/
		for (i = 0; i < Width; i ++)
		{
			if (X + i >= 0 && X + i <= 127)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
			{
				/*璐熸暟鍧愭爣鍦ㄨ绠楅〉鍦板潃鍜岀Щ浣嶆椂闇€瑕佸姞涓€涓亸绉?/
				Page = Y / 8;
				Shift = Y % 8;
				if (Y < 0)
				{
					Page -= 1;
					Shift += 8;
				}
				
				if (Page + j >= 0 && Page + j <= 7)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
				{
					/*鏄剧ず鍥惧儚鍦ㄥ綋鍓嶉〉鐨勫唴瀹?/
					OLED_DisplayBuf[Page + j][X + i] |= Image[j * Width + i] << (Shift);
				}
				
				if (Page + j + 1 >= 0 && Page + j + 1 <= 7)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
				{					
					/*鏄剧ず鍥惧儚鍦ㄤ笅涓€椤电殑鍐呭*/
					OLED_DisplayBuf[Page + j + 1][X + i] |= Image[j * Width + i] >> (8 - Shift);
				}
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED浣跨敤printf鍑芥暟鎵撳嵃鏍煎紡鍖栧瓧绗︿覆锛堟敮鎸丄SCII鐮佸拰涓枃娣峰悎鍐欏叆锛?
  * 鍙?   鏁帮細X 鎸囧畾鏍煎紡鍖栧瓧绗︿覆宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鏍煎紡鍖栧瓧绗︿覆宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細FontSize 鎸囧畾瀛椾綋澶у皬
  *           鑼冨洿锛歄LED_8X16		瀹?鍍忕礌锛岄珮16鍍忕礌
  *                 OLED_6X8		瀹?鍍忕礌锛岄珮8鍍忕礌
  * 鍙?   鏁帮細format 鎸囧畾瑕佹樉绀虹殑鏍煎紡鍖栧瓧绗︿覆锛岃寖鍥达細ASCII鐮佸彲瑙佸瓧绗︽垨涓枃瀛楃缁勬垚鐨勫瓧绗︿覆
  * 鍙?   鏁帮細... 鏍煎紡鍖栧瓧绗︿覆鍙傛暟鍒楄〃
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細鏄剧ず鐨勪腑鏂囧瓧绗﹂渶瑕佸湪OLED_Data.c閲岀殑OLED_CF16x16鏁扮粍瀹氫箟
  *           鏈壘鍒版寚瀹氫腑鏂囧瓧绗︽椂锛屼細鏄剧ず榛樿鍥惧舰锛堜竴涓柟妗嗭紝鍐呴儴涓€涓棶鍙凤級
  *           褰撳瓧浣撳ぇ灏忎负OLED_8X16鏃讹紝涓枃瀛楃浠?6*16鐐归樀姝ｅ父鏄剧ず
  *           褰撳瓧浣撳ぇ灏忎负OLED_6X8鏃讹紝涓枃瀛楃浠?*8鐐归樀鏄剧ず'?'
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_Printf(int16_t X, int16_t Y, uint8_t FontSize, char *format, ...)
{
	char String[256];						//瀹氫箟瀛楃鏁扮粍
	va_list arg;							//瀹氫箟鍙彉鍙傛暟鍒楄〃鏁版嵁绫诲瀷鐨勫彉閲廰rg
	va_start(arg, format);					//浠巉ormat寮€濮嬶紝鎺ユ敹鍙傛暟鍒楄〃鍒癮rg鍙橀噺
	vsprintf(String, format, arg);			//浣跨敤vsprintf鎵撳嵃鏍煎紡鍖栧瓧绗︿覆鍜屽弬鏁板垪琛ㄥ埌瀛楃鏁扮粍涓?
	va_end(arg);							//缁撴潫鍙橀噺arg
	OLED_ShowString(X, Y, String, FontSize);//OLED鏄剧ず瀛楃鏁扮粍锛堝瓧绗︿覆锛?
}

/**
  * 鍑?   鏁帮細OLED鍦ㄦ寚瀹氫綅缃敾涓€涓偣
  * 鍙?   鏁帮細X 鎸囧畾鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉鏄剧ず
	{
		/*灏嗘樉瀛樻暟缁勬寚瀹氫綅缃殑涓€涓狟it鏁版嵁缃?*/
		OLED_DisplayBuf[Y / 8][X] |= 0x01 << (Y % 8);
	}
}

/**
  * 鍑?   鏁帮細OLED鑾峰彇鎸囧畾浣嶇疆鐐圭殑鍊?
  * 鍙?   鏁帮細X 鎸囧畾鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 杩?鍥?鍊硷細鎸囧畾浣嶇疆鐐规槸鍚﹀浜庣偣浜姸鎬侊紝1锛氱偣浜紝0锛氱唲鐏?
  */
uint8_t OLED_GetPoint(int16_t X, int16_t Y)
{
	if (X >= 0 && X <= 127 && Y >=0 && Y <= 63)		//瓒呭嚭灞忓箷鐨勫唴瀹逛笉璇诲彇
	{
		/*鍒ゆ柇鎸囧畾浣嶇疆鐨勬暟鎹?/
		if (OLED_DisplayBuf[Y / 8][X] & 0x01 << (Y % 8))
		{
			return 1;	//涓?锛岃繑鍥?
		}
	}
	
	return 0;		//鍚﹀垯锛岃繑鍥?
}

/**
  * 鍑?   鏁帮細OLED鐢荤嚎
  * 鍙?   鏁帮細X0 鎸囧畾涓€涓鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y0 鎸囧畾涓€涓鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細X1 鎸囧畾鍙︿竴涓鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y1 鎸囧畾鍙︿竴涓鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawLine(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1)
{
	int16_t x, y, dx, dy, d, incrE, incrNE, temp;
	int16_t x0 = X0, y0 = Y0, x1 = X1, y1 = Y1;
	uint8_t yflag = 0, xyflag = 0;
	
	if (y0 == y1)		//妯嚎鍗曠嫭澶勭悊
	{
		/*0鍙风偣X鍧愭爣澶т簬1鍙风偣X鍧愭爣锛屽垯浜ゆ崲涓ょ偣X鍧愭爣*/
		if (x0 > x1) {temp = x0; x0 = x1; x1 = temp;}
		
		/*閬嶅巻X鍧愭爣*/
		for (x = x0; x <= x1; x ++)
		{
			OLED_DrawPoint(x, y0);	//渚濇鐢荤偣
		}
	}
	else if (x0 == x1)	//绔栫嚎鍗曠嫭澶勭悊
	{
		/*0鍙风偣Y鍧愭爣澶т簬1鍙风偣Y鍧愭爣锛屽垯浜ゆ崲涓ょ偣Y鍧愭爣*/
		if (y0 > y1) {temp = y0; y0 = y1; y1 = temp;}
		
