RitsuYi/STM32_Embedded_Journey/04_Projects/代码部分/Hardware/OLED.c
		/*閬嶅巻Y鍧愭爣*/
		for (y = y0; y <= y1; y ++)
		{
			OLED_DrawPoint(x0, y);	//渚濇鐢荤偣
		}
	}
	else				//鏂滅嚎
	{
		/*浣跨敤Bresenham绠楁硶鐢荤洿绾匡紝鍙互閬垮厤鑰楁椂鐨勬诞鐐硅繍绠楋紝鏁堢巼鏇撮珮*/
		/*鍙傝€冩枃妗ｏ細https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
		/*鍙傝€冩暀绋嬶細https://www.bilibili.com/video/BV1364y1d7Lo*/
		
		if (x0 > x1)	//0鍙风偣X鍧愭爣澶т簬1鍙风偣X鍧愭爣
		{
			/*浜ゆ崲涓ょ偣鍧愭爣*/
			/*浜ゆ崲鍚庝笉褰卞搷鐢荤嚎锛屼絾鏄敾绾挎柟鍚戠敱绗竴銆佷簩銆佷笁銆佸洓璞￠檺鍙樹负绗竴銆佸洓璞￠檺*/
			temp = x0; x0 = x1; x1 = temp;
			temp = y0; y0 = y1; y1 = temp;
		}
		
		if (y0 > y1)	//0鍙风偣Y鍧愭爣澶т簬1鍙风偣Y鍧愭爣
		{
			/*灏哬鍧愭爣鍙栬礋*/
			/*鍙栬礋鍚庡奖鍝嶇敾绾匡紝浣嗘槸鐢荤嚎鏂瑰悜鐢辩涓€銆佸洓璞￠檺鍙樹负绗竴璞￠檺*/
			y0 = -y0;
			y1 = -y1;
			
			/*缃爣蹇椾綅yflag锛岃浣忓綋鍓嶅彉鎹紝鍦ㄥ悗缁疄闄呯敾绾挎椂锛屽啀灏嗗潗鏍囨崲鍥炴潵*/
			yflag = 1;
		}
		
		if (y1 - y0 > x1 - x0)	//鐢荤嚎鏂滅巼澶т簬1
		{
			/*灏哫鍧愭爣涓嶻鍧愭爣浜掓崲*/
			/*浜掓崲鍚庡奖鍝嶇敾绾匡紝浣嗘槸鐢荤嚎鏂瑰悜鐢辩涓€璞￠檺0~90搴﹁寖鍥村彉涓虹涓€璞￠檺0~45搴﹁寖鍥?/
			temp = x0; x0 = y0; y0 = temp;
			temp = x1; x1 = y1; y1 = temp;
			
			/*缃爣蹇椾綅xyflag锛岃浣忓綋鍓嶅彉鎹紝鍦ㄥ悗缁疄闄呯敾绾挎椂锛屽啀灏嗗潗鏍囨崲鍥炴潵*/
			xyflag = 1;
		}
		
		/*浠ヤ笅涓築resenham绠楁硶鐢荤洿绾?/
		/*绠楁硶瑕佹眰锛岀敾绾挎柟鍚戝繀椤讳负绗竴璞￠檺0~45搴﹁寖鍥?/
		dx = x1 - x0;
		dy = y1 - y0;
		incrE = 2 * dy;
		incrNE = 2 * (dy - dx);
		d = 2 * dy - dx;
		x = x0;
		y = y0;
		
		/*鐢昏捣濮嬬偣锛屽悓鏃跺垽鏂爣蹇椾綅锛屽皢鍧愭爣鎹㈠洖鏉?/
		if (yflag && xyflag){OLED_DrawPoint(y, -x);}
		else if (yflag)		{OLED_DrawPoint(x, -y);}
		else if (xyflag)	{OLED_DrawPoint(y, x);}
		else				{OLED_DrawPoint(x, y);}
		
		while (x < x1)		//閬嶅巻X杞寸殑姣忎釜鐐?
		{
			x ++;
			if (d < 0)		//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滄柟
			{
				d += incrE;
			}
			else			//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滃寳鏂?
			{
				y ++;
				d += incrNE;
			}
			
			/*鐢绘瘡涓€涓偣锛屽悓鏃跺垽鏂爣蹇椾綅锛屽皢鍧愭爣鎹㈠洖鏉?/
			if (yflag && xyflag){OLED_DrawPoint(y, -x);}
			else if (yflag)		{OLED_DrawPoint(x, -y);}
			else if (xyflag)	{OLED_DrawPoint(y, x);}
			else				{OLED_DrawPoint(x, y);}
		}	
	}
}

/**
  * 鍑?   鏁帮細OLED鐭╁舰
  * 鍙?   鏁帮細X 鎸囧畾鐭╁舰宸︿笂瑙掔殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鐭╁舰宸︿笂瑙掔殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Width 鎸囧畾鐭╁舰鐨勫搴︼紝鑼冨洿锛?~128
  * 鍙?   鏁帮細Height 鎸囧畾鐭╁舰鐨勯珮搴︼紝鑼冨洿锛?~64
  * 鍙?   鏁帮細IsFilled 鎸囧畾鐭╁舰鏄惁濉厖
  *           鑼冨洿锛歄LED_UNFILLED		涓嶅～鍏?
  *                 OLED_FILLED			濉厖
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawRectangle(int16_t X, int16_t Y, uint8_t Width, uint8_t Height, uint8_t IsFilled)
{
	int16_t i, j;
	if (!IsFilled)		//鎸囧畾鐭╁舰涓嶅～鍏?
	{
		/*閬嶅巻涓婁笅X鍧愭爣锛岀敾鐭╁舰涓婁笅涓ゆ潯绾?/
		for (i = X; i < X + Width; i ++)
		{
			OLED_DrawPoint(i, Y);
			OLED_DrawPoint(i, Y + Height - 1);
		}
		/*閬嶅巻宸﹀彸Y鍧愭爣锛岀敾鐭╁舰宸﹀彸涓ゆ潯绾?/
		for (i = Y; i < Y + Height; i ++)
		{
			OLED_DrawPoint(X, i);
			OLED_DrawPoint(X + Width - 1, i);
		}
	}
	else				//鎸囧畾鐭╁舰濉厖
	{
		/*閬嶅巻X鍧愭爣*/
		for (i = X; i < X + Width; i ++)
		{
			/*閬嶅巻Y鍧愭爣*/
			for (j = Y; j < Y + Height; j ++)
			{
				/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖婊＄煩褰?/
				OLED_DrawPoint(i, j);
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED涓夎褰?
  * 鍙?   鏁帮細X0 鎸囧畾绗竴涓鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y0 鎸囧畾绗竴涓鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細X1 鎸囧畾绗簩涓鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y1 鎸囧畾绗簩涓鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細X2 鎸囧畾绗笁涓鐐圭殑妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y2 鎸囧畾绗笁涓鐐圭殑绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細IsFilled 鎸囧畾涓夎褰㈡槸鍚﹀～鍏?
  *           鑼冨洿锛歄LED_UNFILLED		涓嶅～鍏?
  *                 OLED_FILLED			濉厖
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawTriangle(int16_t X0, int16_t Y0, int16_t X1, int16_t Y1, int16_t X2, int16_t Y2, uint8_t IsFilled)
{
	int16_t minx = X0, miny = Y0, maxx = X0, maxy = Y0;
	int16_t i, j;
	int16_t vx[] = {X0, X1, X2};
	int16_t vy[] = {Y0, Y1, Y2};
	
	if (!IsFilled)			//鎸囧畾涓夎褰笉濉厖
	{
		/*璋冪敤鐢荤嚎鍑芥暟锛屽皢涓変釜鐐圭敤鐩寸嚎杩炴帴*/
		OLED_DrawLine(X0, Y0, X1, Y1);
		OLED_DrawLine(X0, Y0, X2, Y2);
		OLED_DrawLine(X1, Y1, X2, Y2);
	}
	else					//鎸囧畾涓夎褰㈠～鍏?
	{
		/*鎵惧埌涓変釜鐐规渶灏忕殑X銆乊鍧愭爣*/
		if (X1 < minx) {minx = X1;}
		if (X2 < minx) {minx = X2;}
		if (Y1 < miny) {miny = Y1;}
		if (Y2 < miny) {miny = Y2;}
		
		/*鎵惧埌涓変釜鐐规渶澶х殑X銆乊鍧愭爣*/
		if (X1 > maxx) {maxx = X1;}
		if (X2 > maxx) {maxx = X2;}
		if (Y1 > maxy) {maxy = Y1;}
		if (Y2 > maxy) {maxy = Y2;}
		
		/*鏈€灏忔渶澶у潗鏍囦箣闂寸殑鐭╁舰涓哄彲鑳介渶瑕佸～鍏呯殑鍖哄煙*/
		/*閬嶅巻姝ゅ尯鍩熶腑鎵€鏈夌殑鐐?/
		/*閬嶅巻X鍧愭爣*/		
		for (i = minx; i <= maxx; i ++)
		{
			/*閬嶅巻Y鍧愭爣*/	
			for (j = miny; j <= maxy; j ++)
			{
				/*璋冪敤OLED_pnpoly锛屽垽鏂寚瀹氱偣鏄惁鍦ㄦ寚瀹氫笁瑙掑舰涔嬩腑*/
				/*濡傛灉鍦紝鍒欑敾鐐癸紝濡傛灉涓嶅湪锛屽垯涓嶅仛澶勭悊*/
				if (OLED_pnpoly(3, vx, vy, i, j)) {OLED_DrawPoint(i, j);}
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED鐢诲渾
  * 鍙?   鏁帮細X 鎸囧畾鍦嗙殑鍦嗗績妯潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍦嗙殑鍦嗗績绾靛潗鏍囷紝鑼冨洿锛?32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Radius 鎸囧畾鍦嗙殑鍗婂緞锛岃寖鍥达細0~255
  * 鍙?   鏁帮細IsFilled 鎸囧畾鍦嗘槸鍚﹀～鍏?
  *           鑼冨洿锛歄LED_UNFILLED		涓嶅～鍏?
  *                 OLED_FILLED			濉厖
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawCircle(int16_t X, int16_t Y, uint8_t Radius, uint8_t IsFilled)
{
	int16_t x, y, d, j;
	
	/*浣跨敤Bresenham绠楁硶鐢诲渾锛屽彲浠ラ伩鍏嶈€楁椂鐨勬诞鐐硅繍绠楋紝鏁堢巼鏇撮珮*/
	/*鍙傝€冩枃妗ｏ細https://www.cs.montana.edu/courses/spring2009/425/dslectures/Bresenham.pdf*/
	/*鍙傝€冩暀绋嬶細https://www.bilibili.com/video/BV1VM4y1u7wJ*/
	
	d = 1 - Radius;
	x = 0;
	y = Radius;
	
	/*鐢绘瘡涓叓鍒嗕箣涓€鍦嗗姬鐨勮捣濮嬬偣*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X + y, Y + x);
	OLED_DrawPoint(X - y, Y - x);
	
	if (IsFilled)		//鎸囧畾鍦嗗～鍏?
	{
		/*閬嶅巻璧峰鐐筜鍧愭爣*/
		for (j = -y; j < y; j ++)
		{
			/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎鍦?/
			OLED_DrawPoint(X, Y + j);
		}
	}
	
	while (x < y)		//閬嶅巻X杞寸殑姣忎釜鐐?
	{
		x ++;
		if (d < 0)		//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滄柟
		{
			d += 2 * x + 1;
		}
		else			//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滃崡鏂?
		{
			y --;
			d += 2 * (x - y) + 1;
		}
		
		/*鐢绘瘡涓叓鍒嗕箣涓€鍦嗗姬鐨勭偣*/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X + y, Y + x);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - y, Y - x);
		OLED_DrawPoint(X + x, Y - y);
		OLED_DrawPoint(X + y, Y - x);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X - y, Y + x);
		
		if (IsFilled)	//鎸囧畾鍦嗗～鍏?
		{
			/*閬嶅巻涓棿閮ㄥ垎*/
			for (j = -y; j < y; j ++)
			{
				/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎鍦?/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
			
			/*閬嶅巻涓や晶閮ㄥ垎*/
			for (j = -x; j < x; j ++)
			{
				/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎鍦?/
				OLED_DrawPoint(X - y, Y + j);
				OLED_DrawPoint(X + y, Y + j);
			}
		}
	}
}

/**
  * 鍑?   鏁帮細OLED鐢绘き鍦?
  * 鍙?   鏁帮細X 鎸囧畾妞渾鐨勫渾蹇冩í鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾妞渾鐨勫渾蹇冪旱鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細A 鎸囧畾妞渾鐨勬í鍚戝崐杞撮暱搴︼紝鑼冨洿锛?~255
  * 鍙?   鏁帮細B 鎸囧畾妞渾鐨勭旱鍚戝崐杞撮暱搴︼紝鑼冨洿锛?~255
  * 鍙?   鏁帮細IsFilled 鎸囧畾妞渾鏄惁濉厖
  *           鑼冨洿锛歄LED_UNFILLED		涓嶅～鍏?
  *                 OLED_FILLED			濉厖
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawEllipse(int16_t X, int16_t Y, uint8_t A, uint8_t B, uint8_t IsFilled)
{
	int16_t x, y, j;
	int16_t a = A, b = B;
	float d1, d2;
	
	/*浣跨敤Bresenham绠楁硶鐢绘き鍦嗭紝鍙互閬垮厤閮ㄥ垎鑰楁椂鐨勬诞鐐硅繍绠楋紝鏁堢巼鏇撮珮*/
	/*鍙傝€冮摼鎺ワ細https://blog.csdn.net/myf_666/article/details/128167392*/
	
