RitsuYi/STM32_Embedded_Journey/04_Projects/代码部分/Hardware/OLED.c
	x = 0;
	y = b;
	d1 = b * b + a * a * (-b + 0.5);
	
	if (IsFilled)	//鎸囧畾妞渾濉厖
	{
		/*閬嶅巻璧峰鐐筜鍧愭爣*/
		for (j = -y; j < y; j ++)
		{
			/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎妞渾*/
			OLED_DrawPoint(X, Y + j);
			OLED_DrawPoint(X, Y + j);
		}
	}
	
	/*鐢绘き鍦嗗姬鐨勮捣濮嬬偣*/
	OLED_DrawPoint(X + x, Y + y);
	OLED_DrawPoint(X - x, Y - y);
	OLED_DrawPoint(X - x, Y + y);
	OLED_DrawPoint(X + x, Y - y);
	
	/*鐢绘き鍦嗕腑闂撮儴鍒?/
	while (b * b * (x + 1) < a * a * (y - 0.5))
	{
		if (d1 <= 0)		//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滄柟
		{
			d1 += b * b * (2 * x + 3);
		}
		else				//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滃崡鏂?
		{
			d1 += b * b * (2 * x + 3) + a * a * (-2 * y + 2);
			y --;
		}
		x ++;
		
		if (IsFilled)	//鎸囧畾妞渾濉厖
		{
			/*閬嶅巻涓棿閮ㄥ垎*/
			for (j = -y; j < y; j ++)
			{
				/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎妞渾*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*鐢绘き鍦嗕腑闂撮儴鍒嗗渾寮?/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
	
	/*鐢绘き鍦嗕袱渚ч儴鍒?/
	d2 = b * b * (x + 0.5) * (x + 0.5) + a * a * (y - 1) * (y - 1) - a * a * b * b;
	
	while (y > 0)
	{
		if (d2 <= 0)		//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滄柟
		{
			d2 += b * b * (2 * x + 2) + a * a * (-2 * y + 3);
			x ++;
			
		}
		else				//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滃崡鏂?
		{
			d2 += a * a * (-2 * y + 3);
		}
		y --;
		
		if (IsFilled)	//鎸囧畾妞渾濉厖
		{
			/*閬嶅巻涓や晶閮ㄥ垎*/
			for (j = -y; j < y; j ++)
			{
				/*鍦ㄦ寚瀹氬尯鍩熺敾鐐癸紝濉厖閮ㄥ垎妞渾*/
				OLED_DrawPoint(X + x, Y + j);
				OLED_DrawPoint(X - x, Y + j);
			}
		}
		
		/*鐢绘き鍦嗕袱渚ч儴鍒嗗渾寮?/
		OLED_DrawPoint(X + x, Y + y);
		OLED_DrawPoint(X - x, Y - y);
		OLED_DrawPoint(X - x, Y + y);
		OLED_DrawPoint(X + x, Y - y);
	}
}

/**
  * 鍑?   鏁帮細OLED鐢诲渾寮?
  * 鍙?   鏁帮細X 鎸囧畾鍦嗗姬鐨勫渾蹇冩í鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~127
  * 鍙?   鏁帮細Y 鎸囧畾鍦嗗姬鐨勫渾蹇冪旱鍧愭爣锛岃寖鍥达細-32768~32767锛屽睆骞曞尯鍩燂細0~63
  * 鍙?   鏁帮細Radius 鎸囧畾鍦嗗姬鐨勫崐寰勶紝鑼冨洿锛?~255
  * 鍙?   鏁帮細StartAngle 鎸囧畾鍦嗗姬鐨勮捣濮嬭搴︼紝鑼冨洿锛?180~180
  *           姘村钩鍚戝彸涓?搴︼紝姘村钩鍚戝乏涓?80搴︽垨-180搴︼紝涓嬫柟涓烘鏁帮紝涓婃柟涓鸿礋鏁帮紝椤烘椂閽堟棆杞?
  * 鍙?   鏁帮細EndAngle 鎸囧畾鍦嗗姬鐨勭粓姝㈣搴︼紝鑼冨洿锛?180~180
  *           姘村钩鍚戝彸涓?搴︼紝姘村钩鍚戝乏涓?80搴︽垨-180搴︼紝涓嬫柟涓烘鏁帮紝涓婃柟涓鸿礋鏁帮紝椤烘椂閽堟棆杞?
  * 鍙?   鏁帮細IsFilled 鎸囧畾鍦嗗姬鏄惁濉厖锛屽～鍏呭悗涓烘墖褰?
  *           鑼冨洿锛歄LED_UNFILLED		涓嶅～鍏?
  *                 OLED_FILLED			濉厖
  * 杩?鍥?鍊硷細鏃?
  * 璇?   鏄庯細璋冪敤姝ゅ嚱鏁板悗锛岃鎯崇湡姝ｅ湴鍛堢幇鍦ㄥ睆骞曚笂锛岃繕闇€璋冪敤鏇存柊鍑芥暟
  */
void OLED_DrawArc(int16_t X, int16_t Y, uint8_t Radius, int16_t StartAngle, int16_t EndAngle, uint8_t IsFilled)
{
	int16_t x, y, d, j;
	
	/*姝ゅ嚱鏁板€熺敤Bresenham绠楁硶鐢诲渾鐨勬柟娉?/
	
	d = 1 - Radius;
	x = 0;
	y = Radius;
	
	/*鍦ㄧ敾鍦嗙殑姣忎釜鐐规椂锛屽垽鏂寚瀹氱偣鏄惁鍦ㄦ寚瀹氳搴﹀唴锛屽湪锛屽垯鐢荤偣锛屼笉鍦紝鍒欎笉鍋氬鐞?/
	if (OLED_IsInAngle(x, y, StartAngle, EndAngle))	{OLED_DrawPoint(X + x, Y + y);}
	if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
	if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
	if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
	
	if (IsFilled)	//鎸囧畾鍦嗗姬濉厖
	{
		/*閬嶅巻璧峰鐐筜鍧愭爣*/
		for (j = -y; j < y; j ++)
		{
			/*鍦ㄥ～鍏呭渾鐨勬瘡涓偣鏃讹紝鍒ゆ柇鎸囧畾鐐规槸鍚﹀湪鎸囧畾瑙掑害鍐咃紝鍦紝鍒欑敾鐐癸紝涓嶅湪锛屽垯涓嶅仛澶勭悊*/
			if (OLED_IsInAngle(0, j, StartAngle, EndAngle)) {OLED_DrawPoint(X, Y + j);}
		}
	}
	
	while (x < y)		//閬嶅巻X杞寸殑姣忎釜鐐?
	{
		x ++;
		if (d < 0)		//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滄柟
		{
			d += 2 * x + 1;
		}
		else			//涓嬩竴涓偣鍦ㄥ綋鍓嶇偣涓滃崡鏂?
		{
			y --;
			d += 2 * (x - y) + 1;
		}
		
		/*鍦ㄧ敾鍦嗙殑姣忎釜鐐规椂锛屽垽鏂寚瀹氱偣鏄惁鍦ㄦ寚瀹氳搴﹀唴锛屽湪锛屽垯鐢荤偣锛屼笉鍦紝鍒欎笉鍋氬鐞?/
		if (OLED_IsInAngle(x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + y);}
		if (OLED_IsInAngle(y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + x);}
		if (OLED_IsInAngle(-x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y - y);}
		if (OLED_IsInAngle(-y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y - x);}
		if (OLED_IsInAngle(x, -y, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y - y);}
		if (OLED_IsInAngle(y, -x, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y - x);}
		if (OLED_IsInAngle(-x, y, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + y);}
		if (OLED_IsInAngle(-y, x, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + x);}
		
		if (IsFilled)	//鎸囧畾鍦嗗姬濉厖
		{
			/*閬嶅巻涓棿閮ㄥ垎*/
			for (j = -y; j < y; j ++)
			{
				/*鍦ㄥ～鍏呭渾鐨勬瘡涓偣鏃讹紝鍒ゆ柇鎸囧畾鐐规槸鍚﹀湪鎸囧畾瑙掑害鍐咃紝鍦紝鍒欑敾鐐癸紝涓嶅湪锛屽垯涓嶅仛澶勭悊*/
				if (OLED_IsInAngle(x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + x, Y + j);}
				if (OLED_IsInAngle(-x, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - x, Y + j);}
			}
			
			/*閬嶅巻涓や晶閮ㄥ垎*/
			for (j = -x; j < x; j ++)
			{
				/*鍦ㄥ～鍏呭渾鐨勬瘡涓偣鏃讹紝鍒ゆ柇鎸囧畾鐐规槸鍚﹀湪鎸囧畾瑙掑害鍐咃紝鍦紝鍒欑敾鐐癸紝涓嶅湪锛屽垯涓嶅仛澶勭悊*/
				if (OLED_IsInAngle(-y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X - y, Y + j);}
				if (OLED_IsInAngle(y, j, StartAngle, EndAngle)) {OLED_DrawPoint(X + y, Y + j);}
			}
		}
	}
}

/*********************鍔熻兘鍑芥暟*/


/*****************姹熷崗绉戞妧|鐗堟潈鎵€鏈?***************/
/*****************jiangxiekeji.com*****************/
